In [1]:
!PGPASSWORD=student createdb -h 127.0.0.1 -U student pagila
!PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-schema.sql
!PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-data.sql

'PGPASSWORD' is not recognized as an internal or external command,
operable program or batch file.
'PGPASSWORD' is not recognized as an internal or external command,
operable program or batch file.
'PGPASSWORD' is not recognized as an internal or external command,
operable program or batch file.

In [2]:
%load_ext sql

In [3]:
DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'student'
DB_PASSWORD = 'student'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)

postgresql://student:student@127.0.0.1:5432/pagila

In [5]:
# %sql $conn_string

# Creating Facts & Dimensions

In [ ]:
%%sql
CREATE TABLE dimDate
(
  date_key      integer NOT NULL PRIMARY KEY,
  date          date NOT NULL,
  year          smallint NOT NULL,
  quarter       smallint NOT NULL,
  month         smallint NOT NULL,
  day           smallint NOT NULL,
  week          smallint NOT NULL,
  is_weekend boolean
);

CREATE TABLE dimRiders
(
  rider_key     SERIAL PRIMARY KEY,
  rider_id      smallint NOT NULL,
  first_name    varchar(100) NOT NULL,
  last_name     varchar(100) NOT NULL,
  address       varchar(50) NOT NULL,
  birthday      date,  
  member_since  date NOT NULL,
  account_start_date    date NOT NULL,
  account_end_date      date NOT NULL, 
  is_member        boolean
);

CREATE TABLE dimStation
(
  station_key         SERIAL PRIMARY KEY,
  station_id          varchar(50) NOT NULL,
  name                varchar(255) NOT NULL,
  lattitude           double,
  longitude           double
);

CREATE TABLE dimTrips
(
  trip_key           SERIAL PRIMARY KEY,
  trip_id            smallint NOT NULL,
  rideable_type      varchar(50) NOT NULL,
  started_at         timestamp NOT NULL,
  ended_at           timestamp NOT NULL,
  start_station_id   varchar(50) NOT NULL,
  end_station_id     varchar(50) NOT NULL,
  rider_id           smallint NOT NULL
);

CREATE TABLE fact_payment
(
  payment_key      SERIAL PRIMARY KEY,
  date_key         INT NOT NULL REFERENCES dimDate(date_key),
  rider_key        INT NOT NULL REFERENCES dimRider(rider_key),
  station_key      INT NOT NULL REFERENCES dimStation(station_key),
  trip_key         INT NOT NULL REFERENCES dimTrip(trip_key),
  amount           decimal(5,2) NOT NULL
);

# ETL the data from 3NF tables to Facts & Dimension Tables

In [ ]:
%%sql
INSERT INTO dimDate (
  date_key, date, year, quarter,
  month, day, week, is_weekend
)
SELECT DISTINCT(TO_CHAR(date :: DATE, 'yyyyMMDD')::integer) AS date_key,
       date(date)                                           AS date,
       EXTRACT(year FROM date)                              AS year,
       EXTRACT(quarter FROM date)                           AS quarter,
       EXTRACT(month FROM date)                             AS month,
       EXTRACT(day FROM date)                               AS day,
       EXTRACT(week FROM date)                              AS week,
       CASE WHEN EXTRACT(ISODOW FROM date) IN (6, 7) THEN true ELSE false END AS is_weekend
FROM payment;

INSERT INTO dimRider (
  rider_key, rider_id, first_name, last_name, address, birthday,
  member_since, account_start_date, account_end_date, is_member
)
SELECT 
    r.rider_id as rider_key,
    r.rider_id,
    r.first_name,
    r.last_name,
    r.address,
    r.birthday,
    r.member_since,
    r.account_start_date,
    r.account_end_date, 
    r.is_member
FROM riders r;

INSERT INTO dimStation 
(
  station_key, station_id,
  name, lattitude, longitude
)
SELECT 
    s.station_id as station_key,
    s.station_id,
    s.name,
    s.lattitude,
    s.longitude
FROM station s;

INSERT INTO dimTrips 
(
  trip_key,  trip_id,  rideable_type,  started_at,
  ended_at,  start_station_id,  end_station_id,  rider_id
)
SELECT 
    trip_id as trip_key,
    trip_id,
    rideable_type,
    started_at,
    ended_at,
    start_station_id,
    end_station_id,
    rider_id
FROM trips;

INSERT INTO fact_payment 
(
  payment_key,  date_key,  rider_key,
  station_key,  trip_key,  amount
)
SELECT 
    TO_CHAR(p.date :: DATE, 'yyyyMMDD')::integer as date_key
    , r.rider_id as rider_key
    , s.station_id as station_key
    , t.trip_id as trip_key
FROM payment p
  JOIN riders r
  JOIN station s
  JOIN trips t
;

# Final CETAS formatted code

In [ ]:
%%sql
INSERT INTO dimDate (
  date_key, date, year, quarter,
  month, day, week, is_weekend
)
SELECT DISTINCT(TO_CHAR(date :: DATE, 'yyyyMMDD')::integer) AS date_key,
       date(date)                                           AS date,
       EXTRACT(year FROM date)                              AS year,
       EXTRACT(quarter FROM date)                           AS quarter,
       EXTRACT(month FROM date)                             AS month,
       EXTRACT(day FROM date)                               AS day,
       EXTRACT(week FROM date)                              AS week,
       CASE WHEN EXTRACT(ISODOW FROM date) IN (6, 7) THEN true ELSE false END AS is_weekend
FROM payment;

INSERT INTO dimRider (
  rider_key, rider_id, first_name, last_name, address, birthday,
  member_since, account_start_date, account_end_date, is_member
)
SELECT 
    r.rider_id as rider_key,
    r.rider_id,
    r.first_name,
    r.last_name,
    r.address,
    r.birthday,
    r.member_since,
    r.account_start_date,
    r.account_end_date, 
    r.is_member
FROM riders r;

INSERT INTO dimStation 
(
  station_key, station_id,
  name, lattitude, longitude
)
SELECT 
    s.station_id as station_key,
    s.station_id,
    s.name,
    s.lattitude,
    s.longitude
FROM station s;

INSERT INTO dimTrips 
(
  trip_key,  trip_id,  rideable_type,  started_at,
  ended_at,  start_station_id,  end_station_id,  rider_id
)
SELECT 
    trip_id as trip_key,
    trip_id,
    rideable_type,
    started_at,
    ended_at,
    start_station_id,
    end_station_id,
    rider_id
FROM trips;

INSERT INTO fact_payment 
(
  payment_key,  date_key,  rider_key,
  station_key,  trip_key,  amount
)
SELECT 
    TO_CHAR(p.date :: DATE, 'yyyyMMDD')::integer as date_key
    , r.rider_id as rider_key
    , s.station_id as station_key
    , t.trip_id as trip_key
FROM payment p
  JOIN riders r
  JOIN station s
  JOIN trips t
;

In [ ]:
IF NOT EXISTS (SELECT * FROM sys.external_file_formats WHERE name = 'SynapseDelimitedTextFormat') 
    CREATE EXTERNAL FILE FORMAT [SynapseDelimitedTextFormat] 
    WITH ( FORMAT_TYPE = DELIMITEDTEXT ,
           FORMAT_OPTIONS (
             FIELD_TERMINATOR = ',',
             USE_TYPE_DEFAULT = FALSE
            ))
GO;

IF NOT EXISTS (SELECT * FROM sys.external_data_sources WHERE name = 'payment_dfs_core_windows_net') 
    CREATE EXTERNAL DATA SOURCE [payment_dfs_core_windows_net] 
    WITH (
        LOCATION = 'https://proj02blobstorage.blob.core.windows.net/udemyproj02-try3/publicpayment.csv' 
    )
GO;


IF OBJECT_ID('dbo.fact_payment') IS NOT NULL
BEGIN
    DROP TABLE fact_payment;
END;


CREATE EXTERNAL TABLE dbo.fact_payment
WITH (
    LOCATION     = 'fact_payment',
    DATA_SOURCE = [payment_dfs_core_windows_net],
    FILE_FORMAT = [SynapseDelimitedTextFormat]
)  
AS
SELECT dt. as date_key, [amount], [date]
FROM [dbo].[staging_payment]


SELECT 
    TO_CHAR(p.date :: DATE, 'yyyyMMDD')::integer as date_key
    , r.rider_id as rider_key
    , s.station_id as station_key
    , t.trip_id as trip_key
FROM [dbo].[staging_payment] p
  JOIN [dbo].[staging_rider] r
  JOIN [dbo].[staging_station] s
  JOIN [dbo].[staging_trip] t    
;
GO;


SELECT TOP 100 * FROM dbo.fact_payment;